import { Filter } from 'bad-words';

export function profanityFilter(text: string): { isValid: boolean; detectedWords: string[] } {
  const filter = new Filter();

  filter.addWords('กระดอ', 'กระทิง', 'กระสัน', 'กวนตีน', 'กวนส้นตีน', 'กินขี้ปี้เยี่ยว',
    'กู', 'ขายตัว', 'ขึ้แตก', 'ควย', 'ควาย', 'จรวย', 'จัญไร', 'ชาติชั่ว',
    'ชาติหมา', 'ชิงหมาเกิด', 'ช้างเย็ด', 'ตีกัน', 'ตีน', 'ตายห่า', 'น้ำเดิน',
    'น้ำแตก', 'นรกแดกกบาล', 'ปี้กัน', 'พ่อง', 'พ่อมึง', 'พ่อมึงตาย', 'มึง',
    'ยัดแม่', 'ยิงกัน', 'ระยำ', 'ร่าน', 'รูตูด', 'ลูกอีกะหรี่', 'ลูกอีดอกทอง',
    'ลูกอีสาด', 'ลูกโสเภณี', 'ล่อกัน', 'สถุล', 'สัด', 'สันดาน', 'สาด',
    'ส้นตีน', 'หน้าควย', 'หน้าตัวเมีย', 'หน้าส้นตีน', 'หน้าหี', 'หน้าโง่',
    'หมา', 'หมาบ้า', 'หัวควย', 'หัวดอ', 'หี', 'ห่า', 'อยากเอาหญิง', 'อัปรีย์',
    'อีกระหรี่', 'อีกะหรี', 'อีควาย', 'อีชาติชั่ว', 'อีช้างเย๊ด', 'อีดอก',
    'อีวาฬ', 'อีสัด', 'อีสัตว์', 'อีหน้าควาย', 'อีหน้าหมา', 'อีหน้าหี', 'อีหมา',
    'อีห่า', 'อีอับปรี', 'อีเหี้ย', 'เควี่ย', 'เงี่ยน', 'เจี๊ยว', 'เชี่ย',
    'เยี่ยว', 'เย็ด', 'เย็ดแม่', 'เศษนรก', 'เสือก', 'เหี้ย', 'เอากัน',
    'แดก', 'แตด', 'แทงกัน', 'แมงดา', 'แม่ง', 'แม่มึง', 'แม่มึงตาย', 'แรด',
    'ใจหมา', 'ไปตายซะ', 'ไอสัด', 'ไอเหี้ย', 'ไอเหี้ยหน้าหี', 'ไอ้ขึ้หมา',
    'ไอ้ควาย', 'ไอ้สัตว์', 'ไอ้สัตว์นรก', 'ไอ้สัส', 'ไอ้ส้นตีน', 'ไอ้หมา',
    'ไอ้เข้', 'อัดตูด', 'อัดถั่ว', 'กาก', 'ขโมย', 'ฆาตกรรม', 'ฆ่า',
    'ฆ่าตัวตาย', 'ตาย', 'ทมิฬ', 'ปล้น', 'ปากแตก', 'ปืน', 'มัจจุราช',
    'รีดไถ', 'วะ', 'ว่ะ', 'หวะ', 'อี', 'อีบ้า', 'เกรียน', 'ไถเงิน', 'ไปสวรรค์',
    'ไอ้', 'ไอ้อ่อน', 'กระจู๋', 'กระเจี๊ยว', 'กรี่', 'กรู', 'กร๊วก',
    'จิ๊', 'จิ๊มิ', 'จิ๋ม', 'ตอแหล', 'ปากดี', 'ฟาย', 'มรึง', 'รากเลือด', 'รากแตก',
    'รูทวาร', 'ลูกตะกั่ว', 'ลูกปืน', 'หน้าด้าน', 'หน้าทน', 'หน้าหนา', 'หางจุกตูด',
    'หิวแสง', 'อีปลวก', 'อีปลาวาฬ', 'อีปลาเงือก', 'อีฟันหมาบ้า', 'อ้วกแตก',
    'ฮากแตก', 'เจี๊ยว', 'เซี่ยน', 'เลือดกลบปาก', 'เศษเดน', 'เหลือเดน', 'เอ็ง',
    'แสกหน้า', 'ไอ้กร๊วก', 'jerk','stupid', 'idiot',
    'sob', 'ass', 'boner', 'wtf', 'stfu', 'fvck', 
    'อิกระหรี่', 'อิกะหรี', 'อิควาย', 'อิชาติชั่ว', 'อิช้างเย๊ด', 'อิดอก',
    'อีวาฬ', 'อิสัด', 'อิสัตว์', 'อิหน้าควาย', 'อิหน้าหมา', 'อิหน้าหี', 'อิหมา',
    'อิห่า', 'อิอับปรี', 'อิเหี้ย','กระหรี่', 'กะหรี', 'ควาย', 'ชาติชั่ว', 'ช้างเย๊ด', 'ดอก',
    'วาฬ', 'สัด', 'สัตว์', 'หน้าควาย', 'หน้าหมา', 'หน้าหี', 'หมา',
    'ห่า', 'อับปรี', 'คฟย', 'ฟวย', 'คว/ย', 'ฟัค', 'ฟาค', 'สัส', 'เยด', 
    'เยสต์', 'มวย', 'หำ', 'หีe', 'หีē', 'ดอ', 'จู๋', 'เย็ส','b!tch', 'sh!t', 
    'fck','f*ck', 's*it', 'b*tch', 'p*ssy', 'sh1t', 'f**k', 'bit*h',
    'คฟย', 'ค*ย', 'ห*', 'มึ*', 'ก*', 'เ*็ด', 'ค.วย', 'ห.ี', 'ม.ึง', 'ก.ู',
    'เ.ย็ด', 'คквг', 'ฟวย', 'คว/ย', 'ค|วย', 'เย็|ด', 'ฟัค', 'ฟาค', 'สัส',
    'ดอกอ', 'เยด', 'เยสต์', 'มวย', 'หำ', 'หีe', 'หีē', 'ดอ', 'จู๋', 'เย็ส', 
    'ไอ้เหี้ย', 'ไอ้', 'เวร','ชั่ว');

  const detectedWords = filter.list.filter(word => text.includes(word));

  const isValid = detectedWords.length === 0;

  return { isValid, detectedWords };
}
